// week14-1 真正的 3x3 打地鼠 (支援滑鼠點擊)
PImage img;

void setup() {
  size(300, 300); 
  img = loadImage("gopher.png"); 
}

int[][] a = { 
  {0, 0, 0}, 
  {0, 0, 0}, 
  {0, 0, 0} 
};

void draw() {
  background(#FFFFF2); 
  fill(#FFFFF2); // 設定方形填色，讓被打死畫出來的方形跟背景顏色一樣
  
  // 1. 隨機冒出地鼠 (給予 60 幀的生命值)
  if (frameCount % 60 == 0) { 
    int i = int(random(3)), j = int(random(3)); 
    a[i][j] = 60; 
  }
  
  // 2. 繪製九宮格狀態
  for (int i=0; i<3; i++) {
    for (int j=0; j<3; j++) {
      float x = j * 100;
      float y = i * 100 + 100; // 預設 Y 座標在洞口下方
      
      if (a[i][j] > 0) { 
        // 【狀態 A：活著的地鼠】
        a[i][j] -= 1; // 生命倒數
        y -= 100 * sin(a[i][j] * PI / 60); // 探頭動畫
        image(img, x, y, 100, 100); 
        
      } else if (a[i][j] < 0) { 
        // 【狀態 B：死掉的地鼠 (顯示大叉叉)】
        y -= 100; // 將 Y 座標推回對齊格子的左上角
        rect(x, y, 100, 100); // 畫一個方塊蓋住原本的位置
        
        // 畫一個大叉叉 X
        line(x, y, x + 100, y + 100); 
        line(x + 100, y, x, y + 100); 
        
        a[i][j] += 1; // 死亡倒數計時：從 -120 慢慢加回 0，到了 0 叉叉就會消失
      }
    }
    // 遮罩魔法：蓋住下半身，讓地鼠有從洞裡鑽出來的感覺
    rect(0, 100 + i*100, 300, 100); 
  }
}

// 3. 滑鼠點擊事件 (打地鼠的關鍵！)
void mousePressed() {
  // 將滑鼠座標 (0~299) 除以 100，瞬間換算成陣列的索引值 (0, 1, 2)
  int i = mouseY / 100;
  int j = mouseX / 100;
  
  // 如果滑鼠點擊的這個格子，剛好有「活著的地鼠」
  if (a[i][j] > 0) { 
    a[i][j] = -120; // 宣判死刑！賦予它負數的值，變成顯示 2 秒鐘 (120幀) 的大叉叉
  }
}
