// 接續 week12-1 week11-1 程式 (3x3 打地鼠)
PImage img; // 宣告圖片變數

void setup() {
  size(300, 300); // 視窗大小 300x300 (剛好可以切成 3x3 的 100x100 九宮格)
  img = loadImage("gopher.png"); // 載入地鼠圖片
}

// 宣告一個 3x3 的二維陣列，用來記錄 9 個地洞的狀態 (數字代表地鼠探出頭的剩餘時間)
int[][] a = { 
  {0, 0, 0}, 
  {0, 0, 0}, 
  {0, 0, 0} 
};

void draw() {
  background(#FFFFF2); // 淡黃色背景
  
  // 1. 亂數產生器：每 60 個 frame (約 1 秒)，就隨機挑一個洞讓地鼠冒出來
  if (frameCount % 60 == 0) { 
    int i = int(random(3)); // 隨機挑選列 (0, 1, 2)
    int j = int(random(3)); // 隨機挑選欄 (0, 1, 2)
    a[i][j] = 60; // 給這隻幸運地鼠 60 frames (1秒鐘) 的出場壽命
  }
  
  // 2. 繪製 3x3 九宮格
  for (int i=0; i<3; i++) {
    for (int j=0; j<3; j++) {
      // 算好每個地洞的基本座標
      float x = j * 100;
      float y = i * 100 + 100; // Y 軸加 100 是為了讓地鼠一開始藏在洞裡
      
      // 3. 地鼠的生命週期與探頭動畫
      if (a[i][j] > 0) {
        a[i][j] -= 1; // 生命倒數計時 (60, 59, 58... 0)
        
        // 核心動畫：利用 cos 函數產生平滑的「升起 -> 降下」效果
        y -= 100 * cos(a[i][j] * PI / 60); 
      }
      
      image(img, x, y, 100, 100); // 把地鼠畫出來
    }
    

    rect(0, 100 + i*100, 300, 100); 
  }
}
