// week09-5.cpp 想要更了解大到小排序
#include <stdio.h>

int main()
{
    // 陣列有 10 個數字 (從小排到大，最後插一個 97)
    int a[10] = {11, 22, 33, 44, 55, 66, 77, 88, 99, 97};

    // 印出交換前的陣列
    for (int i=0; i<10; i++) printf("%d ", a[i]); // 擠一行
    printf("\n"); // 跳行

    // 只有一層迴圈！(負責相鄰比較)
    for (int i=0; i<10-1; i++) { // 小心，i < 10-1 的「-1」減1

        if ( a[i] < a[i+1] ) {   // 希望左大、右小，但現在「反過來」

            // 就交換 (經典的三步換位)
            int temp = a[i];
            a[i] = a[i+1];
            a[i+1] = temp;
        }
    }

    // 印出交換後的陣列
    for (int i=0; i<10; i++) printf("%d ", a[i]); // 擠一行
    printf("\n"); // 跳行

    return 0;
}
