// week09-6.cpp 重複 week09-5 做很多次 變成「泡泡排序法Bubble Sort」
#include <stdio.h>
int main()
{
    // 陣列有 10 個數字 (原先是從小排到大)
    int a[10] = {11, 22, 33, 44, 55, 66, 77, 88, 97, 99};

    // 印出一開始的陣列狀態 (圖中第一個紅框)
    for (int i=0; i<10; i++) printf("%d ", a[i]);
    printf("\n"); // 跳行

    // --- 完整的氣泡排序法開始 ---
    // 外層迴圈 k：控制要執行幾「回合」。因為每回合能搞定一個數字，10個數字跑 9 回合即可。
    for (int k=0; k<10-1; k++) { // 多加這一行

        // 內層迴圈 i：負責把目前這回合「最小的數字」往右邊推
        for (int i=0; i<10-1; i++) { // 小心，i < 10-1
            if ( a[i] < a[i+1] ) {   // 希望左大、右小 (降冪排序)

                // 經典的三步交換
                int temp = a[i];
                a[i] = a[i+1];
                a[i+1] = temp;
            }
        }

        // 每跑完一回合，就把當前的陣列狀態印出來觀察 (對應黑畫面裡的每一行)
        // 圖中第二個紅框被移到迴圈裡面了
        for (int i=0; i<10; i++) printf("%d ", a[i]);
        printf("\n");

    } // 只加這一行 (外層迴圈結束)

    return 0;
}
